Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟར་སྔོན་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་ཡང་། རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པས་དེ་དག་དང་ལྡན་པ་ཡང་མ་ཡིན། དེའི་ཕྱིར་ཕྱིས་ཀྱང་དེ་དག་དང་བྲལ་བ་ཡང་མ་ཡིན་ནོ་ཞེས་བྱའོ།
en: This is saying that it is not the case that it was conjoined earlier and later became disjoined, because, since it is naturally pure even during the earlier period when it is together with stains, it is not conjoined with them, and therefore later as well it is not disjoined from them either. “

source: །ཚེ་དང་ལྡན་པ་རབ་འབྱོར་སེམས་གང་ལ་སེམས་མ་ཡིན་ནོ་ཞེས་བྱ་བའི་སེམས་དེ་ཡོད་དམ་ཞེས་བྱ་བ་ཅི་ལས་དགོངས་ཤེ་ན།
en: Venerable Subhūti, the thought of which you say ‘it is no thought,’ does that thought exist?” What does he have in mind?

source: འདི་ལྟར་སེམས་དེ་སེམས་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་གནས་བརྟན་རབ་འབྱོར་གྱིས་དེའི་གནས་སྐབས་ན་ཡང་སེམས་ཞེས་བྱ་བའི་སྒྲར་བརྗོད་པས་སེམས་དེ་སེམས་མ་ཡིན་པའི་མཚན་ཉིད་དུ་ཡོད་པར་གྱུར་ཏོ་སྙམ་ནས་དྲིས་པའོ།
en: He inquires thinking like this: When the elder Subhūti said “because that thought is no thought,” even then he gave expression to the word “thought,” so that thought would come to exist with the mark of thought.

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་དེ་ལ་བདག་ནི་སེམས་ཀྱི་མཚན་ཉིད་དམ། སེམས་མ་ཡིན་པའི་མཚན་ཉིད་ཡོད་དོ་ཞེས་ནི་མི་སྨྲའོ།
en: Then the elder Subhūti, having in mind, “I am not saying the mark of thought or the mark of no thought exists.

source: །བརྗོད་དུ་མེད་པའི་བདག་ཉིད་དུ་རྣམ་པར་གནས་པ་ཤིན་ཏུ་ཡོངས་སུ་དག་པ་ལ་ཐ་དད་དུ་བརྗོད་པའི་དུས་ན་རྣམ་པ་གཞན་དུ་བརྗོད་དུ་མི་རུང་བའི་ཕྱིར། སྔོན་གྱི་ཤུགས་ཀྱི་རྗེས་སུ་འབྲང་བས་སེམས་ཞེས་བྱ་བ་དང་། སེམས་མ་ཡིན་ཞེས་བྱ་བར་སྨྲའོ་སྙམ་དུ་དགོངས་ནས། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་གང་སེམས་མ་ཡིན་པ་དེ་ལ་ཡོད་པའང་མེད་པས་དམིགས་པའམ་ཡོད་པར་འགྱུར་རམ་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: It is not right to say, when talking about an absolute purity established as being inexpressible in its nature as being different, that it is something different, so I am saying ‘thought’ and ‘no thought’ through the force of prior usage,” inquires of him, “Venerable Śāriputra, can you apprehend existence or nonexistence there, in that state of no thought?”

source: སེམས་མ་ཡིན་པའི་གནས་སྐབས་ན་ཡོད་པའམ་མེད་པ་གཉིས་ཀར་ཡང་བརྗོད་པར་མི་བྱ་སྟེ། མཐའ་གཉིས་ལ་བརྟེན་པར་འགྱུར་བའི་ཕྱིར་རོ་སྙམ་དུ་དགོངས་པའོ།
en: He intends to say that when it is no thought you cannot say it either exists or does not exist, because that would be resorting to two extremes.

source: །དེའི་ཕྱིར་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་དེ་ནི་མ་ཡིན་ནོ་ཞེས་གསུངས་སོ།
en: Therefore it says, “No, Venerable Subhūti.”

source: །དེ་ནས་ཡང་གནས་བརྟན་རབ་འབྱོར་གྱིས་གལ་ཏེ་དེའི་གནས་སྐབས་ན་མཐའ་གཉིས་ཀྱིས་འཇིགས་པས་གཉི་ག་ལྟར་ཡང་བརྗོད་དུ་མི་རུང་ན། ཅིའི་ཕྱིར་ཁྱོད་འདི་སྐད་དུ་འདྲི་ཞེས་ཁྱོད་ཀྱིས་བརྒལ་ཞིང་བརྟགས་པ་འདི་ཅི་ག་རིགས་སམ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Then the elder Subhūti, because it is not suitable to express it at that time in either way because of the danger posed by the two extremes, again asks why he asks that: “Is then… this argumentative investigation of yours… appropriate?”

source: །དེ་སྐད་གསུངས་པ་དང་གནས་བརྟན་ཤཱ་རིའི་བུས་གལ་ཏེ་ཡོད་པ་དང་མེད་པ་དག་མེད་ན། དེ་ལྟ་ན་ནི་སེམས་མ་ཡིན་པའི་མཚན་ཉིད་ཀྱང་མེད་པར་འགྱུར་ན། ཅིའི་ཕྱིར་སེམས་མ་ཡིན་པ་ཞེས་སྨྲ་སྙམ་དུ་དགོངས་ནས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་སེམས་མ་ཡིན་པ་ཞེས་བྱ་བ་དེ་གང་ཡིན་ཞེས་གསུངས་སོ།
en: After he has said that, Śāriputra, thinking that if he is saying it neither exists nor does not exist then even the mark of no thought does not exist, so why does he say it is no thought, counters, “Venerable Subhūti, what is the state of no thought?”

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས། དེ་ལ་བདག་ནི་སེམས་མ་ཡིན་པའི་མཚན་ཉིད་གཞན་དུ་གྱུར་པས་བསམས་ཏེ་སེམས་མ་ཡིན་པ་ཞེས་བྱ་བ་མི་སྨྲའི།
en: Then the elder Subhūti thinks: I am not saying to him “no thought,” having in mind a mark of no thought in some other form.

source: སྔོན་དྲི་མ་དང་བཅས་པའི་གནས་སྐབས་ན་གང་འགྱུར་བ་དང་། རྣམ་པར་རྟོག་པ་ཅན་ཡིན་པའི་ཕྱིར་དེ་ལ་སེམས་ཞེས་བྱ་བ་ད་ནི་དེ་ལྟ་བུ་མེད་པའི་ཕྱིར་སེམས་ཞེས་བྱ་བའི་དངོས་པོ་མེད་པ་ཙམ་ཞིག་ཁས་བླངས་ནས་སེམས་མ་ཡིན་ཞེས་བྱ་བ་བརྗོད་པར་བྱའོ་ཞེས་བསྟན་པའི་ཕྱིར།
en: It has to be called “thought” during the earlier period when it is together with stains, because it has distortion and conceptualization, and, because something like that does not exist— “no thought” having asserted the mere nonexistence of the thing called “thought.”

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སེམས་མ་ཡིན་པ་ནི་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པའོ་ཞེས་བྱ་བ་གསུངས་སོ། །སྔོན་སེམས་ཀྱི་གནས་སྐབས་ལྟར་འགྱུར་བ་དང་། རྣམ་པར་རྟོག་པ་ཅན་གྱི་དངོས་པོ་མེད་པ་ལ་འདིར་སེམས་མ་ཡིན་པ་ཞེས་བྱའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་སྐད་སྨྲས་པ་དང་གནས་བརྟན་ཤཱ་རིའི་བུས་ཅི་དེའི་གནས་སྐབས་ན་སེམས་ཁོ་ན་འགྱུར་བ་མེད་ཅིང་།
en: In order to teach that, he says, “Venerable Śāriputra, the state of no thought is a state without distortion and without conceptualization,” by which he means that the nonexistence of something that has distortion and conceptualization—like thought during the earlier period—is “no thought.”

source: རྣམ་པར་རྟོག་པ་མེད་པ་ཡིན་ནམ། འོན་ཏེ་ཆོས་ཐམས་ཅད་ཀྱང་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་ཡིན་སྙམ་ནས། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཇི་ལྟར་སེམས་ལ་འགྱུར་བ་མེད་ཅིང་། རྣམ་པར་རྟོག་པ་མེད་པ་དེ་བཞིན་དུ། གཟུགས་ལ་ཡང་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་པ་ཡིན་ནམ་ཞེས་བྱ་བ་ལ་སོགས་པ་དྲིས་སོ།
en: When he says that, the elder Śāriputra, wondering if during that period it is only thought that is without distortion and without conceptualization, or whether all dharmas are without distortion and without conceptualization, asks “Venerable Subhūti, just as thought is without distortion and without conceptualization, so too is form without distortion and without conceptualization?”

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དག་ལ་ཡང་འགྱུར་བ་མེད་ཅིང་རྣམ་པར་རྟོག་པ་མེད་དོ་ཞེས་བསྟན་ཏོ།
en: Then the elder Subhūti explains that the buddhadharmas up to “unsurpassed, perfect, complete awakening are without distortion and without conceptualization as well.” “

source: །བཅོམ་ལྡན་འདས་ཀྱི་སྲས་ཐུགས་ལས་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་བརྫུས་ཏེ་སྐྱེས་པའི་བུ་དག་ནི་ཕའི་སྙིང་ལས་སྐྱེས་པས་ན་ཐུགས་ལས་སྐྱེས་པའི་སྲས་ཞེས་བྱའོ།
en: The Lord’s son, close to his bosom”— children born miraculously, in that they are born from their father’s heart, are called “children close to his bosom.”

source: །ཡང་ན་སྲས་ཀྱི་ཐུ་བོ་ལ་བྱ་སྟེ།
en: Alternatively, take this as the foremost child.

source: དེ་བཞིན་དུ་གནས་བརྟན་འདི་ཡང་ཐུགས་ཀྱི་སེམས་ལས་སྐྱེས་པས་ན་ཐུགས་ལས་སྐྱེས་པས་ཞེས་བྱ་སྟེ། ཞི་གནས་དང་ལྷག་མཐོང་ཡིད་ལ་བྱེད་པ་ལས་བྱུང་བའི་ཕྱིར་རོ། །ཞལ་ནས་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་བཤད་པའི་ཆོས་ལས་བྱུང་བའི་ཕྱིར་རོ། །ཆོས་ལས་སྐྱེས་པ་ཞེས་བྱ་བ་ནི་སྒྲུབ་པའི་ཆོས་ལས་བྱུང་བའི་ཕྱིར་རོ།
en: So this elder, in that he is a son born from the heart-mind, is “close to his bosom,” because he has come about from attention to calm abiding and special insight.

source: །ཆོས་ཀྱི་སྤྲུལ་པ་ཞེས་བྱ་བ་ནི་ལམ་དང་འབྲས་བུ་དང་རྟོག་པའི་ཆོས་རྣམས་ལས་སྐྱེས་པའི་ཕྱིར་རོ། །ཆོས་ཀྱི་བགོ་སྐལ་ལ་སྤྱོད་པ་ཞེས་བྱ་བ་ནི་མྱ་ངན་ལས་འདས་པའི་ཆོས་ཀྱི་བདག་པོར་འགྱུར་བའི་ཕྱིར་རོ། །ཟང་ཟིང་གི་བགོ་སྐལ་ལ་སྤྱོད་པ་མ་ཡིན་ཞེས་བྱ་བ་ནི་སྲེད་པ་སྤངས་པའི་ཕྱིར་རོ། །ཆོས་རྣམས་ལ་མངོན་སུམ་གྱི་མིང་དང་ལྡན་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ལས་གཞན་དག་གིས་མི་འཕྲོགས་པའི་ཕྱིར་རོ། །ལུས་མངོན་སུམ་དུ་གྱུར་པ་ཞེས་བྱ་བ་ནི་གཟུགས་དང་།
en: He is “born from his mouth,” because he has come about from explanations of the doctrine; “born from his Dharma,” because he has come about from Dharma practice; “magically produced from his Dharma,” because he is born from path, result, and realization Dharma; “his Dharma heir,” because he takes ownership of nirvāṇa—the Dharma; “not heir to material possessions,” because he has eliminated craving; “a direct eyewitness to the dharmas,” because he is not captured by anything other than the true nature of dharmas; and “who witnesses with your body,” because he has attained the form and formless absorptions and has witnessed the dharma body.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཐོབ་པ་དང་།
en: He is “foremost of those who are at the conflict-free stage.”

source: ཆོས་ཀྱི་སྐུ་མངོན་སུམ་དུ་བྱས་པའི་ཕྱིར་རོ། །ཉོན་མོངས་པ་མེད་པར་གནས་པ་རྣམས་ཀྱི་མཆོག་ཅེས་བྱ་བ་ནི་ཉན་ཐོས་ཀྱི་ཚུལ་གྱི་ཉོན་མོངས་པའི་སྒྲ་དང་མི་མཐུན་པའི་ཕྱོགས་ཀྱི་སྙོམས་པར་འཇུག་པ་ལ་ཉོན་མོངས་པ་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཞེས་བྱ་སྟེ།
en: In the śrāvaka system the meditative absorption that discourages harmful words is called the conflict-free meditative absorption.

source: དེས་གནས་པའི་ཕྱིར་ཉོན་མོངས་པ་མེད་པར་གནས་པ་ཞེས་བྱའོ།
en: Because he is at that stage he is called “at the conflict-free stage.”

source: །འདི་ནི་རྣམ་པར་རྟོག་པའི་སྤྲོས་པ་ཐམས་ཅད་ལ་ཉོན་མོངས་པ་ཞེས་བྱ་སྟེ།
en: Here, all conceptual thought construction is called “conflict.”

source: དེ་དག་མེད་པའི་ཕྱིར་རྣམ་པར་མི་རྟོག་པའི་སྙོམས་པར་འཇུག་པ་ལ་ཉོན་མོངས་པ་མེད་པ་ཞེས་བྱ་སྟེ།
en: Because all of that is absent, the nonconceptual meditative absorption is called without conflict.

source: དེས་གནས་པ་ལ་ཉོན་མོངས་པ་མེད་པར་གནས་པ་ཞེས་བྱའོ།
en: Because he is at that stage he is called “at the conflict-free stage.”

source: །དེ་ནས་གནས་བརྟན་ཤཱ་རིའི་བུས་ལེགས་སོ་ཞེས་བྱ་བའི་བསྔགས་པ་ལ་སོགས་པས་མངོན་པར་དགའ་བར་བྱས་ནས་དེ་ལྟར་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་མི་ལྡོག་པ་ཡིན་པར་བསྟན་ཏེ། ཉན་ཐོས་དང་རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་སློབ་པ་ཐམས་ཅད་ལ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་ཕན་འདོགས་པ་ཡིན་པར་བརྗོད་ནས་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་ཐེག་པ་གསུམ་རྒྱ་ཆེར་བསྟན་ཏོ་ཞེས་རྗེས་སུ་ཡི་རང་བར་བྱས་ཏེ། བརྩོན་པའི་ཕན་ཡོན་གྱི་མཇུག་བསྡུས་སོ།
en: Then the elder Śāriputra causes delight by praising with “excellent!” and so on, teaches that a bodhisattva engaged in such an endeavor is irreversible from achieving awakening, and, having set forth all training at the śrāvaka and pratyekabuddha level, and at the Bodhisattva level as benefiting this perfection of wisdom, rejoices in the fact that “in this perfection of wisdom is detailed instruction for the three vehicles,” bringing the benefits of the endeavor to a conclusion.

source: །དེ་ལྟར་བརྩོན་པའི་ཕན་ཡོན་བསྟན་ནས། བརྩོན་པ་ལ་རྣམ་པ་དུ་ཡོད་སྙམ་པ་ལ་བརྩོན་པའི་རབ་ཏུ་དབྱེ་བ་བསྟན་དགོས་ཏེ། འདི་མན་ཆད་ངེས་པར་འབྱིན་པ་སྒྲུབ་པ་དྲུག་བསྟན་ཏོ།
en: Subdivisions of the endeavor Having thus taught the benefits of the endeavor, there has to be an explanation of the subdivisions of the endeavor for those who wonder about the endeavor’s many aspects, so from here on there is an explanation of six practices that cause going forth.

source: །ངེས་པར་འབྱིན་པའི་སྒྲུབ་པ་དྲུག་ནི་མཐའ་གཉིས་དང་བྲལ་བ་སྒྲུབ་པ་དང་། མི་གནས་པར་སྒྲུབ་པ་དང་། ཡོངས་སུ་འཛིན་པ་མེད་པར་སྒྲུབ་པ་དང་། ཡོངས་སུ་བརྟགས་པའི་སྒྲུབ་པ་དང་། ཐབས་ལ་སྒྲུབ་པ་དང་།
en: The six practices that cause going forth are practice free from the two extremes,practice that does not stand,practice that does not fully grasp,practice that has made a full investigation,practice of method, andpractice for quickly fully awakening.

source: མྱུར་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་སྒྲུབ་པ་སྟེ། འདི་ལྟར་དེ་དག་ངེས་པར་འབྱིན་པ་ཡིན་པར་ཡང་མཇུག་བསྡུས་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་མི་གནས་པའི་ཚུལ་གྱིས་གནས་ཏེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ངེས་པར་འབྱུང་ཞིང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཉེ་བར་འགྱུར་རོ་ཞེས་བྱ་བ་ལ་སོགས་པས་བཅོམ་ལྡན་འདས་ཉིད་ཀྱིས་བསྟན་ཏོ།
en: The Lord himself also teaches that these sorts of practices cause going forth when he sums up in conclusion with “those bodhisattva great beings stand on the irreversible level by way of not taking their stand on it and will go forth to the knowledge of all aspects and will be near the knowledge of all aspects,” and so on.

source: །དྲུག་པོ་དེ་དག་ཀྱང་འོག་ནས་{གོ་རིམས་,གོ་རིམ་}བཞིན་དུ་སོ་སོའི་གནས་གནས་ནས་སྟོན་ཏོ།
en: It teaches each of the six in its own place below.

source: །ད་ནི་གནས་བརྟན་རབ་འབྱོར་གྱིས་སྒྲུབ་པ་དེ་དྲུག་གི་སྐབས་དབྱེ་བའི་ཕྱིར། བཅོམ་ལྡན་འདས་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་འཚལ། མ་དམིགས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་གང་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱིའོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་སོ།
en: Practice free from the two extremes Now, the elder Subhūti, in order to set the scene for these six practices, says, “Lord, given that I do not find, do not apprehend, and do not see a bodhisattva or the perfection of wisdom, to which bodhisattva will I give advice and instruction in what perfection of wisdom?”

source: །འདིས་རྣམ་པ་བཞི་བསྟན་ཏེ།
en: and so on.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་མངོན་སུམ་དང་། རྗེས་སུ་དཔག་པ་དང་། གཏན་ལ་དབབ་པར་བསྟན་པའི་དབང་གིས་ཚད་མ་གསུམ་པོ་དག་གིས་མི་དམིགས་པར་གདམས་པར་འོས་པའི་གང་ཟག་དང་།
en: This is a fourfold teaching of a bodhisattva and the perfection of wisdom, as well as of a person who is suitable to be given instruction in what cannot be apprehended by the three valid cognitions governed by direct perception, inference, or conclusive teaching, and a perfection of wisdom that is a suitable instruction.

source: གདམས་སུ་རུང་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དག་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ནས་གང་ཟག་ལ་སྦྱོར་བར་བྱ་སྙམ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ལ་གདམས་ཤིང་རྗེས་སུ་བསྟན་པར་བགྱི་ཞེས་བྱ་བའི་མཐར་ཐུག་པའི་བར་གྱི་གཞུང་གིས་གསོལ་ཏོ།
en: Thinking that he does not see them, so, as to what person should they be construed, he poses the question in the passage ending with “give advice and instruction in what perfection of wisdom?”

source: །དེ་ནས་ཡང་གདམས་སུ་རུང་བའི་དངོས་པོ་གང་ཡང་ཚད་མ་གསུམ་གྱིས་མི་དམིགས་པས་དངོས་པོ་མེད་པའི་ཆོས་ཀྱིས་དངོས་པོ་མེད་པའི་ཆོས་ལ་གདམས་པར་བྱ་བ་དེ་ཉིད་བདག་གིས་འགྱོད་པར་འགྱུར་ཏེ། ཆོས་དམིགས་སུ་མེད་པའི་ཕྱིར་གདམས་པ་མི་ནུས་སོ་སྙམ་ནས། བདག་གིས་དངོས་པོ་མ་འཚལ། མ་དམིགས། ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ། བཅོམ་ལྡན་འདས་བདག་གིས་དངོས་པོ་མ་འཚལ། མ་དམིགས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བཞིན་དུ་ཆོས་གང་གིས།
en: Then, since no real thing suitable to be the instructions can be apprehended with the three valid cognitions either, “this”—the instruction in an unreal dharma by an unreal dharma—“really” makes him “uneasy,” which is to say, thinking he is unable to give instruction in a dharma that cannot be apprehended he thus teaches the passage from, “Lord, given that I do not find, do not apprehend, and do not see any real basis…—Lord, while not finding, not apprehending, and not seeing any real basis, which dharma will advise and instruct which dharma?”

source: ཆོས་གང་ལ་རྗེས་སུ་གདམས་ཤིང་བསྟན་པར་བགྱི་ཞེས་བྱ་བ་ནས་འདི་ཉིད་བདག་འགྱོད་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ལ་ཐུག་པའི་བར་གྱི་གཞུང་གིས་བསྟན་ཏོ།
en: ending with “this really is something I might be uneasy about.”

source: །འདིར་འགྱོད་པ་ཞེས་བྱ་བ་ནི་ཡིད་ལ་གཅགས་པ་ལ་མི་བྱའི། ཉེས་པར་བྱས་པའི་དངོས་པོ་ལ་འགྱོད་པ་ཞེས་བྱ་བ་སྟེ།
en: Here do not take “uneasy” as mental regret; “uneasy” is about a thing done badly.

source: མི་ཤེས་པར་བྱས་ཏེ་སྐྱོན་དུ་འགྱུར་རོ་སྙམ་དུ་དགོངས་པའོ།
en: He intends, “It would be a fault because I would not have understood.”

source: །དེ་ནས་ཡང་དེ་ལྟར་སྔར་བསྟན་པའི་གདམས་པ་གཞག་པས་གང་ཟག་དང་ཆོས་རྣམས་དངོས་པོ་མེད་ན། མིང་ཙམ་དུ་ཟད་པར་བཟུང་སྟེ།ཇི་ལྟར་གང་ཟག་དང་ཆོས་རྣམས་ལ་འཕེལ་བ་དང་འགྲིབ་པར་བྱ་སྙམ་ནས།
en: Again, persons and dharmas that are real things do not exist when presented as in the explanation of the instruction above; therefore, having taken them as simply just names, how could the persons and the dharmas wax and wane?

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་བདག་གིས་ཆོས་ཐམས་ཅད་མ་འཚལ། མ་དམིགས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ན། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བ་འམ། ཤེས་རབ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་པའི་མིང་ཙམ་གྱིས་ཇི་ལྟར་འཕེལ་བ་དང་། འགྲིབ་པར་བགྱི་ཞེས་བྱ་བའི་གཞུང་གིས་བསྟན་ཏོ།
en: With that thought he makes this statement: “Because, Lord, given that I do not find, do not apprehend, and do not see all dharmas, this really is something I might be uneasy about, how I might make just the name bodhisattva and just the name perfection of wisdom wax and wane.” “

source: །ཡང་དག་པར་ཡོད་པ་མ་ཡིན་པ་ལ་སྒྲོ་འདོགས་པ་ནི་འཕེལ་བ་ཞེས་བྱའོ། །ཡང་དག་པར་ཡོད་པ་ལ་སྐུར་པ་འདེབས་པ་ནི་འགྲིབ་པ་ཞེས་བྱའོ།
en: Wax” is the over-reification of what does not truly exist; “wane” is the over-negation of what does truly exist.

source: །དེ་ནས་མིང་དེ་ཉིད་ཀྱང་དངོས་པོ་མེད་པར་བསྟན་པའི་ཕྱིར། །བཅོམ་ལྡན་འདས་མིང་དེ་ཡང་གནས་པ་མ་མཆིས་ཐུག་པ་མ་མཆིས་ཏེ།
en: Then, in order to teach that even those very names are not real things, he says, “Lord, furthermore, that name does not stand alone and does not meet up with anything.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: And why?

source: མིང་དེ་མ་མཆིས་པས་ཞེས་བྱ་བ་གསུངས་ཏེ།
en: It is because that name does not exist.” “

source: གནས་པ་མ་མཆིས་ཞེས་བྱ་བ་ནི་འདུས་བྱས་ཀྱི་ཆོས་དེ་ལྟར་གནས་པ་མེད་པའོ། །ཐུག་པ་མ་མཆིས་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་ལ་སོགས་པ་འདུས་མ་བྱས་པ་ལྟ་བུར་གནས་པ་མེད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ། །དེ་ལྟར་བསྟན་ནས།
en: Does not stand alone” means a compounded dharma thus does not stand; “does not meet up with anything” means that an uncompounded dharma like space and so on does not stand.

source: གནས་བརྟན་གྱིས་ཆོས་གཞན་རེ་རེ་ལ་ཡང་སྒྲོ་བཏགས་པ་དང་སྐུར་པ་བཏབ་པའི་མཐའ་སྤངས་པར་ཡང་དག་པར་མཐོང་ནས་བྱང་ཆུབ་སེམས་དཔའ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ་བའི་མིང་དུ་གདགས་པར་འོས་པའི་ཆོས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བར་བསྟན་པའི་ཕྱིར། བཅོམ་ལྡན་འདས་བདག་གིས་གཟུགས་ཀྱི་འཕེལ་བ་དང་། འགྲིབ་པ་མ་དམིགས། ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་ཏེ། ཕུང་པོ་རྣམས་དང་ཁམས་རྣམས་དང་། སྐྱེ་མཆེད་རྣམས་དང་། རེག་པ་དྲུག་དང་། ཚོར་བའི་ཚོགས་དྲུག་དང་། ཁམས་དྲུག་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་ཡན་ལག་རྣམས་དང་། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་དང་། ཀུན་ནས་ལྡང་བ་རྣམས་དང་། སྒྲིབ་པ་རྣམས་དང་། བག་ལ་ཉལ་བ་རྣམས་དང་། ཀུན་ཏུ་སྦྱོར་བ་རྣམས་དང་། ལྟ་བར་གྱུར་པ་རྣམས་དང་། བདག་དང་། སེམས་ཅན་དང་། སྲོག་ལ་སོགས་པ་བཅུ་གསུམ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: After teaching like that, Subhūti, in order to further teach that, having seen every other dharma freed from the extremes of over-reification and over-negation, he does not see anything that could be labeled with the names bodhisattva or perfection of wisdom, says, “Lord, given that I do not apprehend and do not see the waxing and waning of form,” and so on.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་དང་མཐུན་པའི་ཆོས་རྣམས་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་དང་། ཚུལ་ཁྲིམས་དང་། གཏོང་བ་དང་། ལྷ་དང་ལུས་སུ་གྱུར་པ་ལ་སྐྱོ་བ་དང་། དབུགས་རྔུབ་པ་དང་། འབྱུང་བ་དང་། འཆི་བ་རྗེས་སུ་དྲན་པ་དང་། མིག་ལྔ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་དང་། རྨི་ལམ་དང་། སྒྱུ་མ་དང་། སྨིག་རྒྱུ་དང་། དྲི་ཟའི་གྲོང་ཁྱེར་དང་། བྲག་ཅ་དང་། མིག་ཡོར་དང་། གཟུགས་བརྙན་དང་། སྤྲུལ་པ་ལྟ་བུའི་ཉེ་བར་ལེན་པའི་ཕུང་པོ་རྣམས་དང་། དབེན་པ་དང་། ཞི་བ་དང་། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། འབྱུང་བ་མེད་པ་དང་། མངོན་པར་འདུ་བྱ་བ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་དང་།
en: Our own Lord Buddha and the tathāgatas together with their śrāvaka saṅghas and bodhisattva communities in as many world systems in the ten directions as there are sand particles in the Gaṅgā River teach the suchness of all the dharmas: the aggregates, constituents, sense fields, six contacts, six feelings, and six elements; the links of dependent origination; greed, hatred, and confusion; obsessions, obscurations, proclivities, fetters, and views; a self, a living being, a creature and so on (the thirteen); all the perfections; all the emptinesses; the dharmas on the side of awakening, gateways to liberation, four concentrations, four immeasurables, and formless absorptions; the Buddha, Dharma, and Saṅgha; morality; giving away; the gods; disgust at what is included in the body; breathing in and out; death; the five eyes, six clairvoyances, ten powers, four fearlessnesses, four detailed and thorough knowledges, eighteen distinct attributes of a buddha, and five appropriating aggregates that are like a dream, illusion, mirage, city of the gandharvas, echo, apparition, reflection in the mirror, and magical creation; isolation, calm, nonproduction, nonstopping, nonappearing, not occasioning anything, nondefilement, and nonpurification; suchness, unmistaken suchness, unaltered suchness, the true nature of dharmas, the dharma-constituent, the establishment of dharmas, the certification of dharmas, the very limit of reality, and the inconceivable element; the wholesome and unwholesome, basic immorality and not basic immorality, with outflows and without outflows, with afflictions and without afflictions, ordinary and extraordinary, compounded and uncompounded, defiled and purified, and saṃsāra and nirvāṇa dharmas; and the past, future, and present.

source: དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་དང་། གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་དང་། ཆོས་ཉིད་དང་། ཆོས་ཀྱི་དབྱིངས་དང་། ཆོས་གནས་པ་ཉིད་དང་། ཆོས་སྐྱོན་མེད་པ་ཉིད་དང་། ཡང་དག་པའི་མཐའ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དབྱིངས་དང་། དགེ་བ་དང་། མི་དགེ་བ་དང་། ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པ་དང་། ཉོན་མོངས་པ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དང་། འཁོར་བ་དང་། མྱ་ངན་ལས་འདས་པའི་ཆོས་རྣམས་དང་། འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བ་རྣམས་ནི། བདག་ཅག་གི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དང་། ཕྱོགས་བཅུ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་ཉན་ཐོས་དང་། བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་བཅས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་སོ་སོར་བསྟན་ཏོ། །དེ་བཞིན་ཉིད་དང་མ་ནོར་བ་དེ་བཞིན་ཉིད་ཅེས་བྱ་བ་ལ་སོགས་པའི་ཚིག་རྣམས་ལ་བྱེ་བྲག་ཅི་ཡོད་ཅེ་ན།
en: What is the difference between the terms “suchness, unmistaken suchness,” and so on?

source: ཡོངས་སུ་གྲུབ་པའི་འཇུག་པ་ཐ་དད་པས་ཐ་དད་དེ།
en: They are differentiated because the referent of the thoroughly established differs.

source: འདི་ལ་ཡོངས་སུ་གྲུབ་པའི་མཚན་ཉིད་ནི་རྣམ་པ་དགུ་སྟེ། འཇིགས་པ་མེད་པར་ཡོངས་སུ་གྲུབ་པ་དང་། ཕྱིན་ཅི་མ་ལོག་པར་ཡོངས་སུ་གྲུབ་པ་དང་། འགྱུར་བ་མེད་པར་ཡོངས་སུ་གྲུབ་པ་དང་། ངོ་བོ་ཉིད་དུ་ཡོངས་སུ་གྲུབ་པ་དང་། རྣམ་པར་བྱང་བའི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་ཉིད་ཡོངས་སུ་གྲུབ་པ་དང་།
en: Here the mark of the thoroughly established is ninefold: the thoroughly established that is indestructible,the thoroughly established without error,the thoroughly established that does not alter,the thoroughly established that is the nature of things,the thoroughly established that is the state causing all purification dharmas,the thoroughly established that is constant,the thoroughly established that is irreversible,the thoroughly established that is true reality, andthe thoroughly established beyond the path of logic.

source: དུས་ཐམས་ཅད་དུ་ཡོངས་སུ་གྲུབ་པ་དང་། ཕྱིར་མི་ལྡོག་པར་ཡོངས་སུ་གྲུབ་པ་དང་། དེ་ཁོ་ན་ཉིད་དུ་ཡོངས་སུ་གྲུབ་པ་དང་། རྟོག་གེའི་ལམ་ལས་འདས་པར་ཡོངས་སུ་གྲུབ་པ་དང་།
en: The thoroughly established that is indestructible is called suchness, because it always stays just like that without being destroyed.

source: འཇིགས་པ་མེད་པར་ཡོངས་སུ་གྲུབ་པ་ནི་དེ་བཞིན་ཉིད་ཅེས་གསུངས་པ་སྟེ། རྟག་ཏུ་དེ་བཞིན་ཉིད་དུ་གནས་ཤིང་མི་འཇིགས་པའི་ཕྱིར་རོ། །ཕྱིན་ཅི་མ་ལོག་པ་ཡོངས་སུ་གྲུབ་པ་ནི་མ་ནོར་བ་དེ་བཞིན་ཉིད་ཅེས་གསུངས་པ་སྟེ། ནོར་བ་དང་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ་མེད་པའི་ཕྱིར་རོ།
en: The thoroughly established without error is called unmistaken suchness because it is without mistakes and is not a form of error.

source: །འགྱུར་བ་མེད་པར་ཡོངས་སུ་གྲུབ་པ་ནི་གཞན་མ་ཡིན་པ་དེ་བཞིན་ཉིད་ཅེས་གསུངས་པ་སྟེ། གཞན་དུ་འགྱུར་བ་མེད་པའི་ཕྱིར་རོ།
en: The thoroughly established that does not alter is called unaltered suchness because it does not change.

source: །ངོ་བོ་ཉིད་དུ་ཡོངས་སུ་གྲུབ་པ་ནི་ཆོས་ཉིད་ཅེས་གསུངས་པ་སྟེ། ཆོས་ཐམས་ཅད་ཀྱི་སྤྱིའི་མཚན་ཉིད་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་ཡིན་པའི་ཕྱིར་རོ།
en: The thoroughly established in its intrinsic nature is called the true nature of dharmas because it is the mark that all dharmas share—having emptiness for their intrinsic nature.

source: །རྣམ་པར་བྱང་བའི་ཆོས་ཐམས་ཅད་ཀྱི་རྒྱུ་ཉིད་ཡོངས་སུ་གྲུབ་པ་ནི་ཆོས་ཀྱི་དབྱིངས་ཞེས་གསུངས་པ་སྟེ། སྟོབས་བཅུ་དང་མི་འཇིགས་པ་ལ་སོགས་པ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱི་དབྱིངས་དང་།
en: The thoroughly established that is the cause of all purification dharmas is called the dharma-constituent because it is the constituent and cause of all the buddhadharmas—the ten powers, the four fearlessnesses, and so on.
